Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71Q19B.PIC
      <edc:SFRDef edc:_addr="0x40034054" edc:access="--nnnnnnnn--nnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN1_IE" edc:impl="0x3FCFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="RF0NE" edc:desc="Receive FIFO 0 New Message Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0WE" edc:desc="Receive FIFO 0 Watermark Reached Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0FE" edc:desc="Receive FIFO 0 Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0LE" edc:desc="Receive FIFO 0 Message Lost Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1NE" edc:desc="Receive FIFO 1 New Message Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1WE" edc:desc="Receive FIFO 1 Watermark Reached Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1FE" edc:desc="Receive FIFO 1 Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1LE" edc:desc="Receive FIFO 1 Message Lost Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPME" edc:desc="High Priority Message Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCE" edc:desc="Transmission Completed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCFE" edc:desc="Transmission Cancellation Finished Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFEE" edc:desc="Tx FIFO Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFNE" edc:desc="Tx Event FIFO New Entry Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFWE" edc:desc="Tx Event FIFO Watermark Reached Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFFE" edc:desc="Tx Event FIFO Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFLE" edc:desc="Tx Event FIFO Event Lost Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSWE" edc:desc="Timestamp Wraparound Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MRAFE" edc:desc="Message RAM Access Failure Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TOOE" edc:desc="Timeout Occurred Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRXE" edc:desc="Message stored to Dedicated Receive Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ELOE" edc:desc="Error Logging Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPE" edc:desc="Error Passive Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EWE" edc:desc="Warning Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOE" edc:desc="Bus_Off Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDIE" edc:desc="Watchdog Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEAE" edc:desc="Protocol Error in Arbitration Phase Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEDE" edc:desc="Protocol Error in Data Phase Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARAE" edc:desc="Access to Reserved Address Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40034058" edc:access="--nnnnnnnn--nnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN1_ILS" edc:impl="0x3FCFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="RF0NL" edc:desc="Receive FIFO 0 New Message Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0WL" edc:desc="Receive FIFO 0 Watermark Reached Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0FL" edc:desc="Receive FIFO 0 Full Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0LL" edc:desc="Receive FIFO 0 Message Lost Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1NL" edc:desc="Receive FIFO 1 New Message Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1WL" edc:desc="Receive FIFO 1 Watermark Reached Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1FL" edc:desc="Receive FIFO 1 Full Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1LL" edc:desc="Receive FIFO 1 Message Lost Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPML" edc:desc="High Priority Message Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCL" edc:desc="Transmission Completed Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCFL" edc:desc="Transmission Cancellation Finished Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFEL" edc:desc="Tx FIFO Empty Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFNL" edc:desc="Tx Event FIFO New Entry Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFWL" edc:desc="Tx Event FIFO Watermark Reached Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFFL" edc:desc="Tx Event FIFO Full Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFLL" edc:desc="Tx Event FIFO Event Lost Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSWL" edc:desc="Timestamp Wraparound Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MRAFL" edc:desc="Message RAM Access Failure Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TOOL" edc:desc="Timeout Occurred Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRXL" edc:desc="Message stored to Dedicated Receive Buffer Interrupt Line" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ELOL" edc:desc="Error Logging Overflow Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPL" edc:desc="Error Passive Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EWL" edc:desc="Warning Status Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOL" edc:desc="Bus_Off Status Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDIL" edc:desc="Watchdog Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEAL" edc:desc="Protocol Error in Arbitration Phase Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEDL" edc:desc="Protocol Error in Data Phase Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARAL" edc:desc="Access to Reserved Address Line" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003405C" edc:access="------------------------------nn" edc:cname="MCAN1_ILE" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="EINT0" edc:desc="Enable Interrupt Line 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EINT1" edc:desc="Enable Interrupt Line 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40034060" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x40034080" edc:access="--------------------------nnnnnn" edc:cname="MCAN1_GFC" edc:impl="0x3F" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="RRFE" edc:desc="Reject Remote Frames Extended" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Filter remote frames with 29-bit extended IDs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REJECT" edc:desc="Reject all remote frames with 29-bit extended IDs." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRFS" edc:desc="Reject Remote Frames Standard" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Filter remote frames with 11-bit standard IDs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REJECT" edc:desc="Reject all remote frames with 11-bit standard IDs." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ANFE" edc:desc="Accept Non-matching Frames Extended" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_0" edc:desc="Accept in Rx FIFO 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_1" edc:desc="Accept in Rx FIFO 1" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ANFS" edc:desc="Accept Non-matching Frames Standard" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_0" edc:desc="Accept in Rx FIFO 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_1" edc:desc="Accept in Rx FIFO 1" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40034084" edc:access="--------nnnnnnnnnnnnnnnnnnnnnn--" edc:cname="MCAN1_SIDFC" edc:impl="0xFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLSSA" edc:desc="Filter List Standard Start Address" edc:nzwidth="0xE"/>
            <edc:SFRFieldDef edc:cname="LSS" edc:desc="List Size Standard" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40034088" edc:access="---------nnnnnnnnnnnnnnnnnnnnn--" edc:cname="MCAN1_XIDFC" edc:impl="0x7FFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLESA" edc:desc="Filter List Extended Start Address" edc:nzwidth="0xE"/>
            <edc:SFRFieldDef edc:cname="LSE" edc:desc="List Size Extended" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003408C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40034090" edc:access="---nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN1_XIDAM" edc:impl="0x1FFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="EIDM" edc:desc="Extended ID Mask" edc:nzwidth="0x1D"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40034094" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="MCAN1_HPMS" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="BIDX" edc:desc="Buffer Index" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="MSI" edc:desc="Message Storage Indicator" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_FIFO_SEL" edc:desc="No FIFO selected." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOST" edc:desc="FIFO message lost." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FIFO_0" edc:desc="Message stored in FIFO 0." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FIFO_1" edc:desc="Message stored in FIFO 1." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIDX" edc:desc="Filter Index" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="FLST" edc:desc="Filter List" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40034098" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN1_NDAT1" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="ND0" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND1" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND2" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND3" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND4" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND5" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND6" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND7" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND8" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND9" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND10" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND11" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND12" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND13" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND14" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND15" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND16" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND17" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND18" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND19" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND20" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND21" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND22" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND23" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND24" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND25" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND26" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND27" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND28" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND29" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND30" edc:desc="New Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND31" edc:desc="New Data" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
