Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71Q19B.PIC
      <edc:SFRDef edc:_addr="0x400386A0" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR8" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400386A4" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR9" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400386A8" edc:offset="0x68"/>
      <edc:SFRDef edc:_addr="0x40038710" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_HSTDMA0USBHS_HSTDMANXTDSC" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:desc="Next Descriptor Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038714" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_HSTDMA0USBHS_HSTDMAADDRESS" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:desc="Buffer Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038718" edc:access="nnnnnnnnnnnnnnnn--------nnnnnnnn" edc:cname="USBHS_HSTDMA0USBHS_HSTDMACONTROL" edc:impl="0xFFFF00FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:desc="Channel Enable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDNXT_DSC" edc:desc="Load Next Channel Transfer Descriptor Enable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_TR_EN" edc:desc="End of Transfer Enable Control (OUT transfers only)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_B_EN" edc:desc="End of Buffer Enable Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_TR_IT" edc:desc="End of Transfer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_BUFFIT" edc:desc="End of Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DESC_LD_IT" edc:desc="Descriptor Loaded Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BURST_LCK" edc:desc="Burst Lock Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BUFF_LENGTH" edc:desc="Buffer Byte Length (Write-only)" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003871C" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:cname="USBHS_HSTDMA0USBHS_HSTDMASTATUS" edc:impl="0xFFFF0073" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:desc="Channel Enable Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:desc="Channel Active Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:desc="End of Channel Transfer Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:desc="End of Channel Buffer Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:desc="Descriptor Loaded Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:desc="Buffer Byte Count" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038720" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_HSTDMA1USBHS_HSTDMANXTDSC" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:desc="Next Descriptor Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038724" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_HSTDMA1USBHS_HSTDMAADDRESS" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:desc="Buffer Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038728" edc:access="nnnnnnnnnnnnnnnn--------nnnnnnnn" edc:cname="USBHS_HSTDMA1USBHS_HSTDMACONTROL" edc:impl="0xFFFF00FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:desc="Channel Enable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDNXT_DSC" edc:desc="Load Next Channel Transfer Descriptor Enable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_TR_EN" edc:desc="End of Transfer Enable Control (OUT transfers only)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_B_EN" edc:desc="End of Buffer Enable Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_TR_IT" edc:desc="End of Transfer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_BUFFIT" edc:desc="End of Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DESC_LD_IT" edc:desc="Descriptor Loaded Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BURST_LCK" edc:desc="Burst Lock Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BUFF_LENGTH" edc:desc="Buffer Byte Length (Write-only)" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003872C" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:cname="USBHS_HSTDMA1USBHS_HSTDMASTATUS" edc:impl="0xFFFF0073" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:desc="Channel Enable Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:desc="Channel Active Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:desc="End of Channel Transfer Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:desc="End of Channel Buffer Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:desc="Descriptor Loaded Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:desc="Buffer Byte Count" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038730" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_HSTDMA2USBHS_HSTDMANXTDSC" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:desc="Next Descriptor Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038734" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBHS_HSTDMA2USBHS_HSTDMAADDRESS" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:desc="Buffer Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038738" edc:access="nnnnnnnnnnnnnnnn--------nnnnnnnn" edc:cname="USBHS_HSTDMA2USBHS_HSTDMACONTROL" edc:impl="0xFFFF00FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:desc="Channel Enable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDNXT_DSC" edc:desc="Load Next Channel Transfer Descriptor Enable Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_TR_EN" edc:desc="End of Transfer Enable Control (OUT transfers only)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_B_EN" edc:desc="End of Buffer Enable Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_TR_IT" edc:desc="End of Transfer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_BUFFIT" edc:desc="End of Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DESC_LD_IT" edc:desc="Descriptor Loaded Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BURST_LCK" edc:desc="Burst Lock Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BUFF_LENGTH" edc:desc="Buffer Byte Length (Write-only)" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003873C" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:cname="USBHS_HSTDMA2USBHS_HSTDMASTATUS" edc:impl="0xFFFF0073" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:desc="Channel Enable Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:desc="Channel Active Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:desc="End of Channel Transfer Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:desc="End of Channel Buffer Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:desc="Descriptor Loaded Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:desc="Buffer Byte Count" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
