Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71Q19B.PIC
      <edc:SFRDef edc:_addr="0x40078020" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="XDMAC_GD" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="DI0" edc:desc="XDMAC Channel 0 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI1" edc:desc="XDMAC Channel 1 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI2" edc:desc="XDMAC Channel 2 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI3" edc:desc="XDMAC Channel 3 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI4" edc:desc="XDMAC Channel 4 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI5" edc:desc="XDMAC Channel 5 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI6" edc:desc="XDMAC Channel 6 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI7" edc:desc="XDMAC Channel 7 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI8" edc:desc="XDMAC Channel 8 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI9" edc:desc="XDMAC Channel 9 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI10" edc:desc="XDMAC Channel 10 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI11" edc:desc="XDMAC Channel 11 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI12" edc:desc="XDMAC Channel 12 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI13" edc:desc="XDMAC Channel 13 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI14" edc:desc="XDMAC Channel 14 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI15" edc:desc="XDMAC Channel 15 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI16" edc:desc="XDMAC Channel 16 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI17" edc:desc="XDMAC Channel 17 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI18" edc:desc="XDMAC Channel 18 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI19" edc:desc="XDMAC Channel 19 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI20" edc:desc="XDMAC Channel 20 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI21" edc:desc="XDMAC Channel 21 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI22" edc:desc="XDMAC Channel 22 Disable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DI23" edc:desc="XDMAC Channel 23 Disable Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40078024" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="XDMAC_GS" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="ST0" edc:desc="XDMAC Channel 0 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST1" edc:desc="XDMAC Channel 1 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST2" edc:desc="XDMAC Channel 2 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST3" edc:desc="XDMAC Channel 3 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST4" edc:desc="XDMAC Channel 4 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST5" edc:desc="XDMAC Channel 5 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST6" edc:desc="XDMAC Channel 6 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST7" edc:desc="XDMAC Channel 7 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST8" edc:desc="XDMAC Channel 8 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST9" edc:desc="XDMAC Channel 9 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST10" edc:desc="XDMAC Channel 10 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST11" edc:desc="XDMAC Channel 11 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST12" edc:desc="XDMAC Channel 12 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST13" edc:desc="XDMAC Channel 13 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST14" edc:desc="XDMAC Channel 14 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST15" edc:desc="XDMAC Channel 15 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST16" edc:desc="XDMAC Channel 16 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST17" edc:desc="XDMAC Channel 17 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST18" edc:desc="XDMAC Channel 18 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST19" edc:desc="XDMAC Channel 19 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST20" edc:desc="XDMAC Channel 20 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST21" edc:desc="XDMAC Channel 21 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST22" edc:desc="XDMAC Channel 22 Status Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ST23" edc:desc="XDMAC Channel 23 Status Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40078028" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_GRS" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="RS0" edc:desc="XDMAC Channel 0 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS1" edc:desc="XDMAC Channel 1 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS2" edc:desc="XDMAC Channel 2 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS3" edc:desc="XDMAC Channel 3 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS4" edc:desc="XDMAC Channel 4 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS5" edc:desc="XDMAC Channel 5 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS6" edc:desc="XDMAC Channel 6 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS7" edc:desc="XDMAC Channel 7 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS8" edc:desc="XDMAC Channel 8 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS9" edc:desc="XDMAC Channel 9 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS10" edc:desc="XDMAC Channel 10 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS11" edc:desc="XDMAC Channel 11 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS12" edc:desc="XDMAC Channel 12 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS13" edc:desc="XDMAC Channel 13 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS14" edc:desc="XDMAC Channel 14 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS15" edc:desc="XDMAC Channel 15 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS16" edc:desc="XDMAC Channel 16 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS17" edc:desc="XDMAC Channel 17 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS18" edc:desc="XDMAC Channel 18 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS19" edc:desc="XDMAC Channel 19 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS20" edc:desc="XDMAC Channel 20 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS21" edc:desc="XDMAC Channel 21 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS22" edc:desc="XDMAC Channel 22 Read Suspend Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RS23" edc:desc="XDMAC Channel 23 Read Suspend Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
