Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71Q19B.PIC
      <edc:SFRDef edc:_addr="0x400880BC" edc:access="--------------nn--nn--nn--nn--nn" edc:cname="MATRIX_PR7MATRIX_PRBS" edc:impl="0x33333" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:desc="Master 8 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:desc="Master 9 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:desc="Master 10 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:desc="Master 11 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:desc="Master 12 Priority" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400880C0" edc:access="--nn--nn--nn--nn--nn--nn--nn--nn" edc:cname="MATRIX_PR8MATRIX_PRAS" edc:impl="0x33333333" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:desc="Master 4 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:desc="Master 5 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:desc="Master 6 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:desc="Master 7 Priority" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400880C4" edc:access="--------------nn--nn--nn--nn--nn" edc:cname="MATRIX_PR8MATRIX_PRBS" edc:impl="0x33333" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:desc="Master 8 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:desc="Master 9 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:desc="Master 10 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:desc="Master 11 Priority" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:desc="Master 12 Priority" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400880C8" edc:offset="0x38"/>
      <edc:SFRDef edc:_addr="0x40088100" edc:access="-------------------nnnnnnnnnnnnn" edc:cname="MATRIX_MRCR" edc:impl="0x1FFF" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="RCB0" edc:desc="Remap Command Bit for Master 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB1" edc:desc="Remap Command Bit for Master 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB2" edc:desc="Remap Command Bit for Master 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB3" edc:desc="Remap Command Bit for Master 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB4" edc:desc="Remap Command Bit for Master 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB5" edc:desc="Remap Command Bit for Master 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB6" edc:desc="Remap Command Bit for Master 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB7" edc:desc="Remap Command Bit for Master 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB8" edc:desc="Remap Command Bit for Master 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB9" edc:desc="Remap Command Bit for Master 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB10" edc:desc="Remap Command Bit for Master 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB11" edc:desc="Remap Command Bit for Master 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB12" edc:desc="Remap Command Bit for Master 12" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40088104" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x40088110" edc:access="nnnnnnnnnnnnnnnn----------------" edc:cname="CCFG_CAN0" edc:impl="0xFFFF0000" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="CAN0DMABA" edc:desc="CAN0 DMA Base Address" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40088114" edc:access="nnnnnnnnnnnnnnnn---n----nnnn----" edc:cname="CCFG_SYSIO" edc:impl="0xFFFF10F0" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SYSIO4" edc:desc="PB4 or TDI Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSIO5" edc:desc="PB5 or TDO/TRACESWO Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSIO6" edc:desc="PB6 or TMS/SWDIO Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSIO7" edc:desc="PB7 or TCK/SWCLK Assignment" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SYSIO12" edc:desc="PB12 or ERASE Assignment" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CAN1DMABA" edc:desc="CAN1 DMA Base Address" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40088118" edc:access="---------nnn--------------------" edc:cname="CCFG_PCCR" edc:impl="0x700000" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="TC0CC" edc:desc="TC0 Clock Configuration" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2SC0CC" edc:desc="I2SC0 Clock Configuration" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2SC1CC" edc:desc="I2SC1 Clock Configuration" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4008811C" edc:access="-----------------------------nnn" edc:cname="CCFG_DYNCKG" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="MATCKG" edc:desc="MATRIX Dynamic Clock Gating" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BRIDCKG" edc:desc="Bridge Dynamic Clock Gating Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EFCCKG" edc:desc="EFC Dynamic Clock Gating Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40088120" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40088124" edc:access="---------------------------nnnnn" edc:cname="CCFG_SMCNFCS" edc:impl="0x1F" edc:nzwidth="0x20" ltx:memberofperipheral="MATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="SMC_NFCS0" edc:desc="SMC NAND Flash Chip Select 0 Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMC_NFCS1" edc:desc="SMC NAND Flash Chip Select 1 Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMC_NFCS2" edc:desc="SMC NAND Flash Chip Select 2 Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMC_NFCS3" edc:desc="SMC NAND Flash Chip Select 3 Assignment" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SDRAMEN" edc:desc="SDRAM Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
